# Parameters
nc: 1 # number of classes
scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs

# YOLOv8.0 backbone + RFCBAMConv
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RFCBAMConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, RFCBAMConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, RFCBAMConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, RFCBAMConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, RFCBAMConv, [256, 1, 1]]  # 10, Y5, lateral_convs.0
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]

  - [6, 1, RFCBAMConv, [256, 1, 1]]  # 12 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 14, fpn_blocks.0
  - [-1, 1, RFCBAMConv, [256, 1, 1]]  # 15, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [4, 1, RFCBAMConv, [256, 1, 1]]  # 17 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [256]]  # X3 (19), fpn_blocks.1

  - [-1, 1, RFCBAMConv, [256, 3, 2]]  # 220, downsample_convs.0
  - [[-1, 15], 1, Concat, [1]]  # cat Y4
  - [-1, 3, C2f, [256]]  # F4 (22), pan_blocks.0

  - [-1, 1, RFCBAMConv, [256, 3, 2]]  # 25, downsample_convs.1
  - [[-1, 10], 1, Concat, [1]]  # cat Y5
  - [-1, 3, C2f, [256]]  # F5 (25), pan_blocks.1

  - [[19, 22, 25], 1, Detect_dyhead, [nc]]  # Detect(P3, P4, P5)